import 'package:gpa_pro/core/constants/app_info.dart';

abstract class PrivacyPolicyArConstants {
  // كل فقرة هنكتبها باسمها واللي جمبها رقم تبقا تحتها وجمبها اللغة
  // static const String privacyPolicy = 'Privacy Policy';
  static const String privacyPolicy1 =
      "MRE قام ببناء تطبيق ${AppInfo.appName} كتطبيق معتمد على الإعلانات. يتم توفير هذه الخدمة بواسطة MRE بدون تكلفة وهي مخصصة للاستخدام كما هي.\nيتم استخدام هذه الصفحة لإبلاغ الزوار بسياساتي فيما يتعلق بجمع واستخدام وكشف المعلومات الشخصية إذا قرر أي شخص استخدام خدمتي.\nإذا قررت استخدام خدمتي، فإنك توافق على جمع واستخدام المعلومات فيما يتعلق بهذه السياسة. يتم استخدام المعلومات الشخصية التي أقوم بجمعها لتوفير الخدمة وتحسينها. لن أستخدم أو أشارك معلوماتك مع أي شخص إلا كما هو موضح في سياسة الخصوصية هذه.\nالمصطلحات المستخدمة في سياسة الخصوصية هذه لها نفس المعاني المشار إليها في شروط وأحكامنا، التي يمكن الوصول إليها في تطبيق ${AppInfo.appName}، ما لم يتم تعريفها خلاف ذلك في سياسة الخصوصية هذه.";
  static const String informationCollectionAndUse =
      '\n\nجمع المعلومات واستخدامها';
  static const String informationCollectionAndUse1 =
      "لتحسين تجربتك أثناء استخدام خدمتنا، قد يُطلب منك توفير بعض المعلومات الشخصية التي يمكن التعرف عليها. المعلومات التي أطلبها ستُحفظ على جهازك ولن يتم جمعها بأي شكل من الأشكال من قِبلي.\nتطبيقنا يستخدم خدمات طرف ثالث قد تقوم بجمع معلومات لتحديد هويتك.\nرابط سياسة الخصوصية لمقدمي الخدمات من الطرف الثالث المستخدمة في التطبيق:";
  static const String informationCollectionAndUse2 = "خدمات جوجل بلاي";

  static const String logData = '\n\nتسجيل البيانات';
  static const String logData1 =
      "أود أن أُبلغك أنه في حالة حدوث خطأ في التطبيق عند استخدام الخدمة، أقوم بجمع بيانات ومعلومات (من خلال منتجات طرف ثالث) على هاتفك تُسمى بيانات السجل (Log Data). يمكن أن تشمل بيانات السجل هذه معلومات مثل عنوان بروتوكول الإنترنت (IP) لجهازك، اسم الجهاز، إصدار نظام التشغيل، تكوين التطبيق عند استخدام الخدمة، ووقت وتاريخ استخدام الخدمة، وإحصاءات أخرى.";

  static const String cookies = '\n\nملفات تعريف الارتباط';
  static const String cookies1 =
      "ملفات تعريف الارتباط هي ملفات تحتوي على كمية صغيرة من البيانات والتي غالبًا ما تستخدم كمعرّفات فريدة للمستخدم بشكل مجهول. يتم إرسالها إلى مستعرضك من المواقع التي تزورها وتخزن في الذاكرة الداخلية لجهازك.\nهذه الخدمة لا تستخدم ملفات تعريف الارتباط 'cookies' بشكل صريح. ومع ذلك، قد يستخدم التطبيق رموز ومكتبات من جهات ثالثة تستخدم ملفات تعريف الارتباط 'cookies' لجمع المعلومات وتحسين خدماتها. لديك الخيار بين قبول أو رفض هذه الملفات تعريف الارتباط ومعرفة متى يتم إرسال ملف تعريف الارتباط إلى جهازك. إذا قمت برفض ملفات تعريف الارتباط، فقد لا تتمكن من استخدام بعض أجزاء هذه الخدمة.";

  static const String serviceProviders = '\n\nمقدمي الخدمة';
  static const String serviceProviders1 =
      "قد أستخدم شركات وأفراد من الطرف الثالث للأسباب التالية:";
  static const String serviceProviders2 = 'لتسهيل خدمتنا';
  static const String serviceProviders3 = 'لتقديم الخدمة نيابة عنا';
  static const String serviceProviders4 = 'لأداء خدمات ذات صلة بالخدمة';
  static const String serviceProviders5 =
      'لمساعدتنا في تحليل كيفية استخدام الخدمة الخاصة بنا';
  static const String serviceProviders6 =
      "أود أن أُبلغ مستخدمي هذه الخدمة بأن هذه الجهات الثالثة لديها الوصول إلى معلوماتهم الشخصية. السبب وراء ذلك هو أداء المهام المُكلفة بها نيابة عنا. ومع ذلك، فإنهم ملزمون بعدم الكشف عن المعلومات أو استخدامها لأي غرض آخر.";

  static const String security = '\n\nالأمان';
  static const String security1 =
      "أنا أقدر ثقتك في تقديم معلوماتك الشخصية، ولذلك نحرص على استخدام وسائل مقبولة تجاريًا لحمايتها. ولكن يجب أن تتذكر أن أي طريقة لنقل المعلومات عبر الإنترنت أو طريقة لتخزينها إلكترونيًا ليست مئة بالمئة آمنة وموثوقة، ولا يمكنني ضمان الأمان المطلق لها.";

  static const String linksToOtherSites = '\n\nروابط إلى مواقع أخرى';
  static const String linksToOtherSites1 =
      "قد يحتوي هذا الخدمة على روابط إلى مواقع أخرى. إذا قمت بالنقر على رابط من جهة ثالثة، ستتم توجيهك إلى تلك الموقع. يُرجى ملاحظة أن هذه المواقع الخارجية ليست تحت إدارتي. لذلك، أوصي بشدة بمراجعة سياسة الخصوصية لهذه المواقع. ليس لدي أي سيطرة على محتوى تلك المواقع الخارجية، ولا أتحمل أي مسؤولية عن محتواها أو سياساتها الخصوصية أو ممارستها.";

  static const String childrenPrivacy = '\n\nخصوصية الأطفال';
  static const String childrenPrivacy1 =
      "هذه الخدمات لا تستهدف أي شخص يقل عمره عن 13 عامًا. وأنا لا أقوم بشكل معرف بجمع معلومات شخصية قابلة للتحديد عن الأطفال الذين تقل أعمارهم عن 13 عامًا. في حالة اكتشافي لتقديم طفل يقل عمره عن 13 عامًا معلومات شخصية، فإنني سأقوم على الفور بحذفها من خوادمنا. إذا كنت ولي أمر أو وصي قانوني وتعلمت أن طفلك قد قدم لنا معلومات شخصية، يُرجى التواصل معي حتى أتمكن من اتخاذ الإجراءات اللازمة.";

  static const String changesToThisPrivacyPolicy =
      '\n\nتغييرات على سياسة الخصوصية';
  static const String changesToThisPrivacyPolicy1 =
      "قد نقوم بتحديث سياسة الخصوصية الخاصة بنا من وقت لآخر. لذلك، يُنصح بمراجعة هذه الصفحة بشكل دوري لأي تغييرات. سنقوم بإخطارك بأي تغييرات عن طريق نشر سياسة الخصوصية الجديدة على هذه الصفحة.\nتكون هذه السياسة سارية المفعول اعتبارًا من تاريخ 2023-07-12.";

  static const String contactUs = '\n\nاتصل بنا';
  static const String contactUs1 =
      "إذا كان لديك أي أسئلة أو اقتراحات بشأن سياسة الخصوصية الخاصة بي، فلا تتردد في الاتصال بي على البريد الإلكتروني: mre9743@gmail.com.";
}
